# GetTypeCatalogStringForSpec Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
UnitUtils..::..GetTypeCatalogStringForSpec Method
UnitUtils Class See Also
---
Gets the string used in type catalogs to identify a given spec.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static string GetTypeCatalogStringForSpec(
	ForgeTypeId specTypeId
)
```

Visual Basic
---
```text
Public Shared Function GetTypeCatalogStringForSpec ( _
	specTypeId As ForgeTypeId _
) As String
```

Visual C++
---
```text
public:
static String^ GetTypeCatalogStringForSpec(
	ForgeTypeId^ specTypeId
)
```

# ### Parameters
specTypeId
    Type: Autodesk.Revit.DB..::..ForgeTypeId Identifier of the spec.
# ### Return Value
The type catalog string, or an empty string if the spec cannot be used in type catalogs.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
UnitUtils Class
Autodesk.Revit.DB Namespace